Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 119, 20)           1148600   
_________________________________________________________________
dropout_1 (Dropout)          (None, 119, 20)           0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 117, 128)          7808      
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 114, 128)          65664     
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 28, 128)           0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 28, 80)            66880     
_________________________________________________________________
lstm_2 (LSTM)                (None, 20)                8080      
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 21        
_________________________________________________________________
activation_1 (Activation)    (None, 1)                 0         
=================================================================
Total params: 1,297,053
Trainable params: 1,297,053
Non-trainable params: 0
_________________________________________________________________
